 {
            "tag" : "greeting",
            "patterns" : [ 
                "สวัสดี", 
                "สวัสดี", "สวัสดี", "สวัสดี", "สวัสดี", "สวัสดี", "สวัสดี", 
                "สวัสดีครับ", 
                "สวัสดีจ้า", 
                "ดีจ้า", 
                "สวัสดีจ้ะ", 
                "ฮัลโหล", 
                "สวัสดีครับ", 
                "สวัสดีค่ะ", 
                "สวัสดีครัช", 
                "ดีครับ", 
                "ดีห่ะ", 
                "สวัสดีฮับ", 
                "สวัสดีอ่ะ", 
                "สวัสดีงับ", 
                "สวัสดีฮับ"
            ],
            "responses" : [ 
                "สวัสดีขอบคุณที่แวะมา", 
                "ดีใจที่เจอคุณอีก", 
                "ต้องการให้ช่วยอะไรครับ", 
                "สอบถามมาได้เลยครับ", 
                "สอบถามเรื่องอะไรครับ", 
                "ต้องการให้ช่วยเหลือด้านไหนครับ"
            ]
        }, 
        {
            "tag" : "Major",
            "patterns" : [ 
                "มีกี่สาขา", 
                "ขอทราบหน่อยว่าที่นี่มีกี่สาขา", 
                "ที่นี่มีกี่สาขา", 
                "สาขาที่นี้มีเท่าไร", 
                "จำนวนที่มีกี่สาขา", 
                "มีกี่สาขาครับ", 
                "มีสาขาวิชาเท่าไร", 
                "สาขาที่นี้มีเท่าไร", 
                "มีกี่สาขาคะ", 
                "สาขามีเท่าไรครับ", 
                "สอบถามหน่อยครับว่าที่วิทยาลัยมีกี่สาขา", 
                "ทางวิทยาลัยมีการเปิดสอนที่นนท์ กี่สาขาครับ", 
                "จำนวนสาขาที่เปิดสอนมีเท่าไรคะ", 
                "ที่นี้มีกี่สาขาที่เปิดทำการเรียนการสอนหลอครับ", 
                "เปิดสอนที่สาขานนท์มีกี่สาขาครับ", 
                "สาขาที่นนท์เปิดสอนจำนวนกี่สาขาหลอครับ", 
                "จะมีให้เลือกสมัครเรียนได้กี่สาขาหลอครับ", 
                "ระดับชั้นที่เปิดสอนมีกี่สาขาหลอครับ", 
                "สาขามีให้เลือกเรียนกี่สาขา", 
                "สาขามีอะไรบางหลอครับและประกอาบด้วยสาขาวิชาอะไรบ้าง"
            ],
            "responses" : [ 
                "แบ่งออกเป็น 2 ระดับครับ  คือ ปวช. และ ปวส โดย ปวช มี 8 สาขา ครับ ได้แก่ สาขาวิชาการบัญชี   สาขาวิชาการตลาด สาขาวิชาคอมพิวเตอร์ธุรกิจ สาขาวิชาภาษาต่างประเทศ สาขาวิชาการโรงแรม สาขาวิชาการท่องเที่ยว สาขาวิชาคอมพิวเตอร์กราฟิค  สาขาวิชาเทคโนโลยีสารสนเทศ และ ปวส.  มี 7 สาขา ครับ  ได้แก่  สาขาวิชาการบัญชี สาขาวิชาการตลาด สาขาวิชาคอมพิวเตอร์ธุรกิจ สาขาวิชาการโรงแรม สาขาวิชาการท่องเที่ยว สาขาวิชาคอมพิวเตอร์กราฟิค สาขาวิชาเทคโนโลยีสารสนเทศ"
            ]
        }, 
        {
            "tag" : "question",
            "patterns" : [ 
                "สวัสดีครับสอบถามหน่อยครับ", 
                " สอบถามอะไรหน่อยคะ", 
                " ถามชหน่อยได้ไหม", 
                " มีเรื่องสอบถาม", 
                " มีเรื่องจะถาม ได้ไหมครับ", 
                " ถามหน่อย มีเรื่องคาใจที่จะ สอบถาม", 
                " สอบถาม ได้ไหมค่ะ", 
                "ต้องการความช่วยเหลือ", 
                "สอบถามทางวิทยาลัยหน่อย", 
                "สอบถามคุณหน่อยคะ", 
                "ถามหน่อยครับ", 
                "ถามเรื่องอะไรหน่อย", 
                "ถามหน่อยครับ ", 
                "ติดต่อสอบถามหน่อยได้ไหมคะ", 
                "ติดต่อทางนี้ได้เลยไหมครับ", 
                "สามารถติดต่อสอบถามได้ทางนี้เลยไหมครับ", 
                "ขอสอบถามการเรียนได้ไหมครับ", 
                "สอบถามการเรื่องการสมัครได้ไหม", 
                "สอบถามการสมัครการเรียนได้ทางนี้เลยไหม", 
                "สอบถามการ สมัครผ่านทางเฟสได้ไหม", 
                "สอบถามการเรียนของแต่ละสาขาได้ไหม", 
                "สอบถามการเข้าสมัครเรียนได้ยังไง", 
                "สอบถามการการลงสมัครแต่ละสาขาได้ไหม"
            ],
            "responses" : [ 
                "สอบถามมาได้เลยครับ ", 
                " สอบถามเรื่องอะไรครับ", 
                " ต้องการให้ช่วยเหลือด้านไหนครับ"
            ]
        }, 
        {
            "tag" : "study",
            "patterns" : [ 
                "ม.ปลาย กับ สายอาชีพ อันไหนเรียนยากกว่ากันครับ", 
                " ทำไมต้องเรียน สายอาชีพครับ", 
                " สายอาชีพเรียนยากกว่า ม.ปลายไหมคับ", 
                " สายอาชีพการเรียนยากไหมครับ", 
                " สายอาชีพการเรียนการสอนจะยากมากไหมคะ", 
                " สายอาชีพง่ายกว่า ม.ปลาย ยังไงหลอค่ะ", 
                " สายอาชีพเรียนยาก มากไหมครับ ", 
                " สายอาชีพการสอนเน้น ไปด้านไหนบางครับ", 
                " สายอาชีพเน้นไปด้านอะไรบ้างคะ", 
                " สายอาชีพเด่นด้านไหนอะไรบางคะ", 
                " สายอาชีพเด่นเรื่องอะไรบ้างหลอครับ", 
                " สอบถามหน่อยครับว่าการเรียนสายอาชีพมีความยากกว่ามัธยมได้อย่างไร", 
                "สายอาชีพการเรียนจะเปิดให้ตัวนักเรียนมีการสอนไปในด้านแบบไหนครับ", 
                "สายอาชีพเรียนยากกว่า มัธยมปลายจริงไหมครับ", 
                "สายอาชีพเด่นการปฏิบัติงานจริงและทำได้กมากกว่า ม ปลาย จริงไหมครับ", 
                "ทำไมคนถึงนิยมการเรียนการสอนแบบสายอาชีพครับ", 
                "ทำไมสายอาชีพถึงเป็นความต้องการของตลาดแรงงานครับ", 
                "ทำไมสายอาชีพถึงได้เรียนปฏิบัติมากกว่าสาย ม ปลาย หลอครับ ", 
                "ถ้าผมจะเรียนสายอาชีพจะได้เรียนการปฏิบัติจริงไหมครับ", 
                "สายอาชีพเป็นความต้องการของตลาดแรงงานและทำไมถึงเป็นความต้องการสายอาชีพขนาดนี้หลอครับ", 
                "การทำงานสายอาชีพจะมีการเน้นไปด้านการเรียนการสอนแบบไหนแบ้างคะ"
            ],
            "responses" : [ 
                "สายอาชีพได้เรียนรู้เรื่องการปฏิษัติจริงที่ได้ลงมือปฏิบัติซึ่งเป็นความต้องการของท้องตลาด แต่่สาย มัธยมปลาย จะเรียนไปทางด้านทฤษดี เป็นหลักครับ"
            ]
        }, 
        {
            "tag" : "hotel",
            "patterns" : [ 
                "สาขาการโรงแรมเรียนอะไรบ้าง", 
                "สาขาโรงแรมนี้ได้เรียนเกี่ยวกับอะไร", 
                "สาขาการโรงแรมเรียนอะไรบ้าง", 
                "โรงแรมเรียนยากไหม", 
                "สาขาโรงแรมมีคนเรียนเยอะไหมครับ", 
                "สาขาโรงแรมได้มีการเรียนหรือสอนอะไรที่นี้มีไหม", 
                "สาขาโรงแรมได้ทำงานเกี่ยวกับอะไร", 
                "โรงแรมได้เรียนด้านไหนบ้าง", 
                "โรงแรมมีความต้องการเยอะไหม", 
                "สาขาโรงแรมเรียนเรื่องอะไรและด้านไหนบ้างครับ", 
                "สาขาโรงแรมมีการสอบการจีบผ้าไหมคะ", 
                "สาขาโรงแรมมีการสอนบริการด้านไหนบ้างครับ", 
                "สาขาโรงแรมจะได้เรียนเรื่องการจีบผ้าหรือการจัดโต๊ะไหมครับ", 
                "สาขาโรงแรมจะสอนเรื่องการจัดโต๊ะหรือจีบผ้าบ้างไหมค่ะ", 
                "สาขาโรงแรมจัดสอนการทำด้านสัมมนาไหมครับ", 
                "สาขาที่มีการจีบผ้าในโรงแรมจะเน้นการทำงานได้จริงหรืเปล่าครับ", 
                "อยากรู้การจีบผ้าและการจัดสัมมนาต้องเรียนสาขาโรงแรมใช่ไหม", 
                "สาขาโรงแรมการจัดจีบผ้าการทำสัมมนาเรียนตัวนี้เยอะไหมครับ", 
                "สาขาโรงแรมสอนการจัดเตรียมที่พักหรือการจัดจับโต๊ะบ้างหรือเปล่าครับ", 
                "สาขาโรงแรมมีการสอบการให้บริการด้านอะไรบ้างครับ"
            ],
            "responses" : [ 
                "สาขาโรงแรม จะเป็นสาขาที่เน้นไปด้านการบริการในงานด้านของโรงแรม  ไม่ว่าจะการจัดสัมมนา การจัดจีบโต๊ะ หรืออื่นๆ  โดยทางวิทยาลัย จะสอนให้นักรียนรู้ในการลงมือปฏิบัติได้จริงครับ"
            ]
        }, 
        {
            "tag" : "graphic",
            "patterns" : [ 
                "ออกแบบ ตัวชิ้นและวาดตัวชิ้นงานต้องเรียนอะไร ", 
                "วาดโครงสร้างตัวและอกแบบตัวชิ้นตัวการ์ตูนต้องเรียนอะไร", 
                "การออกผลิตภัณฑ์เรียนสาขาอะไร", 
                "การวาดภาพบุคคล เรียนสาขาอะไรได้บ้าง", 
                "สาขาการวาดอนิเมชั่นต้องสาขาใด", 
                "เรียนสาขา เกียวกับแอนิเมชันต้องเรียนสาขาอะไร", 
                "อยากเรียนสาขาที่ทำแอนิเมชันต้องเรียนอะไร", 
                "เรียน การออกแบบสื่อสิ่งพิมพ์ต้องเรียนสาขาอะไร", 
                "เรียน สาขาคอมพิวเตอร์มีงานรองรับเยอะไหม", 
                "สาขาคอมพิวเตอร์กราฟิกและการออกแบบวาดภาพสอนไรบ้าง", 
                "สาขาคอมพิวกราฟิกจะมีการสอบออกแบบผลิตสื่อสิ่งพิมและการทำแอนิเมชันด้วยหรือเปล่าครับ", 
                "การวาดตัวชิ้นงานกับตัวการ์ตูนคอมพิวเตอร์กราฟิกมีสอนด้านนี้รวมอยู่ในหลักสูตรด้วยไหมครับ", 
                "สาขาคอมพิวเตอร์กราฟิกมีการสอนวาดภาพบุคคลไหมครับ", 
                "การวาดภาพบุคคลให้เหมือนจริงคอมพิวเตอร์กราฟฟิกมีการเปิดสอนไหมค่ะ", 
                "สื่อสิ่งพิมพ์จะมีหลักการออบแบบอย่างไรบางครับและคอมพิวเตอร์กราฟิกจะมีสอนไหมครับ", 
                "ผลิตภัณฑ์อย่างเช่นขวดจะมีการออกแบบต้องใช้ความรู้ด้านใดบ้างหลอครับและผมจะได้เรียนเรื่องพวกนี้ในสาขาคอมพิวเตอร์กราฟิกด้วยไหมครับ", 
                "ตัวการ์ตูนต้องมีความรู้ในด้านคอมพิวเตอร์กราฟิกและคอมกราฟฟิกจะสอนอะไรในงานการออบแบบการ์ตูนบ้างครับ", 
                "คอมพิวเตอร์กราฟิกงานการออบแบบเรียนเยอะไหมครับ", 
                "งานด้านตัวการออกแบบการ์ตูนจะได้เรียนในสาขาคอมพิวเตอร์กราฟิกบ้างไหมครับ", 
                "คอมพิวเตอร์กราฟิก วาดภาพให้เสมือนบุคคลจะทำได้ในสาขาคอมพิวเตอร์กราฟิกไหมค่ะ"
            ],
            "responses" : [ 
                "สาขาคอมพิวเตอร์กราฟิก จะสอนการเรียนรู้ในงานการออกแบบต่าง ๆ ไม่ว่าจะเป็นสือสิ่งพิม ตัวการ์ตูน ออกแบบผลิตภัทณ์ อนิเมชั่น โดยทางวิทยาลัย มีเปิดการสอน ในระบบ ปวช. และ ปวส. ครับ"
            ]
        }, 
        {
            "tag" : "food",
            "patterns" : [ 
                "เรียนเชฟที่เกี่ยวกับอาหารต้อง เรียนสาขาอะไรครับ", 
                "เรียนเชฟจบสาขาเกี่ยวกับอาหารไปทำงานอะไรหลอคะ", 
                "เรียนเชฟจบสาขาเกียวกับอาหารมีโรงแรมใดบ้างรองรับ", 
                "สาขาที่เรียนเกี่ยวกับอาหารไปสามารถเรียนต่ออะไรใดบ้าง", 
                "จบสาขาที่เกียวอาหารจะได้วุฒิอะไร", 
                "ค่าจ่ายกับสาขาเกียวกับอาหารเท่าไร", 
                "จบสาขาเชฟเกี่ยวกับอาหารมีเงินเดือนประมาณเท่าใด", 
                "สาขาเชฟ เรียนได้ในระดับชั้นอะไร", 
                "สาขาเชฟ สมัครเรียนยังไง", 
                "เรียน เกี่ยวกับอาหารต้องเรียนสาขาอะไร", 
                "สาขาเซฟนานาติจะได้เรียนรู้การทำอาหารนานาติจริงไหมครับ", 
                "อาหารนานาติมันมีเยอะไหมครับและการเป็นเซฟที่นี้มีสาขาเกี่ยวกับเซฟบ้างไหม", 
                "สาขาที่เกี่ยวกับเซฟจะได้ทำอาหารและมีการทำงานในโรงแรมบ้างไหมครับ", 
                "เซฟจะมีการเรียนในระดับขั้นไหนบ้างครับ", 
                "สาขาเซฟนานาชาติจะเปิดสอนในด้านไหนบ้างครับและตัวนักเรียนจะได้เรียนรู้อะไรในการทำเซฟนานาติบ้างครับ", 
                "สาขาเซฟจะต้องสมัครและได้การเรียนการสอนในด้านไหนบ้างครับ", 
                "สาขเซฟนี้การทำอาหารนานานติขะได้เรียนรู้ได้ยังไงบ้างครับ", 
                "สามารถเรียนสาขาเชฟไปทำงานในด้านและเรียนต่อได้สาขาอะรไรได้บ้าง", 
                "เงินเดือนสาขาเซฟมีเงินเดือนประมาณเท่าไรบ้างหลอครับ", 
                "ระดับชั้นที่เปิดสอนในสาขาเซฟมีกี่ระดับชั้นและประกอบด้วยระดับชั้นอะไรบ้างครับ"
            ],
            "responses" : [ 
                "สาขาเชฟนานาชาติ จะได้เรียนรู้เรื่องการทำอะไร นานาชาติ ได้ทั้งไทยและต่างประเทศ​ สาขาเชฟนานาชาติ จะเป็นการเรียนรู้ในการด้านทำอาหารซึ่งเป็นความต้องการของตลาดครับ"
            ]
        }, 
        {
            "tag" : "university",
            "patterns" : [ 
                "มหาลัยไหนบ้างที่รับ จบ ปวส", 
                "จบปวส จะต่อหาลัยไหมได้บ้าง ", 
                "จบปวส. เข้ามหาลัยไหนได้บ้าง", 
                "จบปวส. เรียนต่อที่ไหนได้บ้าง", 
                "ปวส. จบที่นี้ต่อไหนได้บ้าง ", 
                "จบปวส. จบต่อไหน", 
                "จบปวส. ต่อมหาลัยยากจริงไหม ", 
                "จบปวส. เรียนต่อเข้ายากไหม ", 
                "จบปวส.ต่อยากจริงไหม ", 
                "จบชปวส. ต่อมหาลัยยากหรือเปล่่า ", 
                "การที่ตัวนักเรียนจบปวส จะต่อมหาวิทยาลัยยากจริงไหมครับ", 
                "มหาลัยจะรับเด็กที่จบปวส. ไหมครับ ", 
                "ปวส หนูเรียนต่อที่ไหนจะได้บ้างไหมครับ", 
                "จบปวส เข้ามหาลัยของที่เดิมได้ไหมครับ", 
                "เขาบอกว่าเด็กเรียนจะหา มหาวิทยาลัยยากถ้าจบ ปวส. มาจริงหรือเปล่าครับ", 
                " นักเรียนจบปวส. มาจะต่อมหาวิทยาลัยต้องเรียนใหม่เลยหรือเปล่าครับ", 
                "ผมจะสมัครเรียน ปวส และไปต่อมหาลัยได้ไหมครับ", 
                "ปวส หามหาลัยยากไหมครับ และถ้าจบแล้วจะสมัครที่ไหนได้บ้าง", 
                "เด็ก ปวส เรียนต่อยากไหมเวลาตอนไปเรียนกับเด็กม ปลายครับ ", 
                "มหาลัยจะรับเด็กปวส ไหมครับและถ้ารับจะมีที่ไหนรับนักเรียนที่จับจาก ปวส. บ้างครับ"
            ],
            "responses" : [ 
                "การเรียนจบ จาก ปวส. สามารถต่อได้หลายสถาบันโดยการเทียบโอนในแต่รายวิชา หรือ ต่อเนื่องที่สาขารองรับ"
            ]
        }, 
        {
            "tag" : "tourism",
            "patterns" : [ 
                "จบสาขาการท่องเที่ยว สามารถเป็นมัคคุเทศก์ได้ไหม", 
                "สาขาการท่องเที่ยว จบแล้วไปประกอบอาชีมัคคุเทศก์และอะไรได้บ้าง", 
                "สาขาการท่องเที่ยว เรียนรู้การนำเที่ยวด้วยหรือป่าว", 
                "อยากเป็นมัคคุเทศก์ต้องเรียนสาขาอะไร", 
                "สาขาท่องเที่ยว เป็นสาขาที่ได้ทำเรียนรู้ไรบ้างครับ", 
                "สาขาท่องเที่ยว ที่นี้มีเปิดเรียน เปิดสอนไหมครับ", 
                "สาขาท่องเที่ยว ต้องรู้ในด้านบ้าง", 
                "สาขาท่องเที่ยว มีความต้องการของตลาดมัคคุเทศก์ไหม", 
                "สาขาการท่องเที่ยว มีค่าใช้จ่ายเท่าใด", 
                "สาขาท่องเที่ยว เปิดในระดับชั้นใดบ้าง", 
                "มัคคุเทศก์จะมีสอนในสาขาการท่องเที่ยวไหมครับ", 
                "งานที่ทำมัคคุเทศก์จะได้เรียนรู้ในด้านอะไรและเกี่ยวกับอะไรบ้างครับ", 
                "การเรียนเกี่ยวกับมัคคุเทศก์จะมีค่าใช้จ่ายเยอะไหม", 
                "สาขาการท่องเที่ยวจะมีการจัดการนำเที่ยวและการท่องเที่ยวด้วยไหมครับ", 
                "ค่าใช้จ่ายที่จ่ายไปในสาขาท่องเที่ยวจะได้เรียนรู้งานอะไรบ้างในการนำเที่ยวบ้างครับ", 
                "ที่นนท์มีการเปิดสอนสาขาการท่องเที่ยวด้วยไหมครับและได้เรียนรู้อะไรกับสาขาท่องเที่ยวบ้างครับ", 
                "จบสาขาการท่องเที่ยวสามารถเป็นมัคคุเทศก์ได้ไหมครับ", 
                "การจัดท่องเที่ยวต้องมค่าใช้จ่ายเองหรือไหมครับ", 
                "ทางวิทยาลัยจะมีการออกค่าใช้จ่ายการจัดการท่องเที่ยวของนักศึกษาที่ไปดูงานไหมครับ", 
                "การท่องเที่ยวและการจัดการนำท่องเที่ยวสามารถต่อยอดการไปเป็นมัคคุเทศก์ในการนำท่องเที่ยวได้ไหมครับ", 
                "การท่องเที่ยวจะได้เรียนรู้การจัดท่องเที่ยวด้วยไหมในสาขาการท่องเที่ยวจะมีการเปิดสอนเรื่องนี้ให้ไหมครับ", 
                "สาขาการท่องเที่ยวมัคคุเทศก์ต้องเรียนรู้งานไหมครับเวลาจบไปและทางวิทยาลัยจะสอนเรื่องอะไรบ้างครับเวลาในการเรียนสาขาขาการท่องเที่ยวและเปิดสอนในระดับชั้นใดบ้าง"
            ],
            "responses" : [ 
                "สาขาการท่องเที่ยว เปิดในระดับชั้น ปวช. ปวส. จะได้เรียนรู้ด้านการทั้งหมดของการท่องเที่ยว และสามารถเรียนรู้การเป็นผู้นำเที่ยวได้ที่สาขานี้"
            ]
        }, 
        {
            "tag" : "basic",
            "patterns" : [ 
                "ต้องมีพื้นฐานก่อนมั้ย", 
                "เรียนต่อสาขาคอมพิวเตอร์ธุรกิจ ต้องรู้พื้นฐานเรื่องอะไรบ้างหรอ", 
                "เราต้องเตรียมตัวยังไงบ้าง", 
                "เรียนต่อต้องเตรียมตัวอย่างไรบ้าง", 
                "เข้าเรียนต้องมีความรู้อะไรบ้างครับ", 
                "มีพื้นฐานสายมปลายเรียนได้ไหม", 
                "เรียนสาขา it ต้องมีพื้นฐานไรก่อนไหม", 
                "ต้องเตรียมตัวอะไรบ้างก่อนเข้าเรียน", 
                "พื้นฐานต้องเน้นไหมถึงจะเรียนที่นี้ได้", 
                "พื้นฐานของเข้าวิทยาลัยนี้มีอะไรบ้าง", 
                "สายเทคโนโลยีต้้องมีพื้นฐานอะไรในการเข้าเรียนสาขา it ไหมครับ ", 
                "ผมสามารถสมัครเรียนกับทางวิทยาลัยได้เลยไหมครับถ้าผมไม่มีความรู้มาก่อนเลย", 
                "ต้องมีการเรียนการปรับพื้นฐานก่อนไหมครับก่อนจะได้ไปเรียนจริงกับทางวิทยาลัย", 
                "การปรับพื้นฐานที่นี้จะมีการสอนให้ไหมครับและต้องมีพื้นฐานมาก่อนไหมถึงเรียนได้", 
                "ต้องเตรียมตัวอย่างไรบ้างครับถ้าหนูไม่มีความรู้มาก่อนเลยคะ", 
                "ถ้าผมเรียนสายม ปลาย ก่อนผมต้องเรียนปรับพื้นฐานไหมและต้องทำอย่างไรบ้างครับ", 
                "ผมจะเรียนสาขา it ผมต้องเตรียมตัวยังไงก่อนไหมครับ เพราะผมไม่เก่งเลยครับ", 
                "การเรียนปรับพื้นฐานต้องมีความรู้มาก่อนไหมถึงจะเรียนได้", 
                "ผมไม่เก่งพื้นฐานต้องทำยังไงบ้างครับถึงผมจะเรียนกับเพื่อนได้", 
                "เรียนรู้พื้นฐานก่อนจะเข้าเรียนต้องเตรียมตัวหรือเปล่าครับ", 
                "วิทยาลัยมีสอนการปรับพื้นฐานหรือเปล่าคะ"
            ],
            "responses" : [ 
                "นักเรียน นักศึกษาที่ไม่มีความรู้สามารถเรียนรู้โดยไม่ต้องการความรู้ใดมาก่อนโดยทางวิทยาลัยจะสอนเนื้อหาตั้งแต่เริ่มต้นจนสิ้นสุด"
            ]
        }, 
        {
            "tag" : "Tuition_fee",
            "patterns" : [ 
                "ค่าเทอมเท่าไร", 
                "ค่าใช้จ่ายเท่าไร", 
                "ค่าใช้จ่ายตลอดหลักสูตรเท่าไร", 
                "สาขานี้มีค่าใช้จ่ายเท่าไร", 
                "มีค่าใช้จ่ายไหม", 
                "ค่าใช้จ่ายต่อเทอมเท่าไร", 
                "ค่าใช้จ่ายเยอะไหม", 
                "ค่าใช้จ่ายเล็กๆ น้อยๆ ไหม", 
                "ค่าใช้จ่ายต่อการสมัครครั้งแรกเยอะไหม", 
                "ค่ามัดจำค่าใช้จ่ายเท่าไร", 
                "การสมัครเข้าเรียนที่วิทยาลัยนี้มีค่าใช้จ่ายประมาณเท่าไรครับ", 
                "ค่าใช้จ่ายของคอมพิวเตอร์ธูรกิจสูงไหมครับ", 
                "ถ้าหนูจะเรียน it จะมีค่าใช้จ่ายตลอดหลักสูตรประมาณเท่าไรหลอค่ะ", 
                "มีค่าใช้จ่ายเล็กๆ น้อย เยอะไหมครับได้ข่าวมาก่อนสมัครว่ามันเยอะอ่ะครับ", 
                "สมัครครั้งแรกต้องสำรองการสมัครเรียนอยู่ที่ประมาณเท่าไรหลอครับ", 
                "ค่าเทอมอยู่ที่ประมาณเท่าไรค่ะของแต่ละสาขาอ่ะคะ", 
                "ค่าเทอมแพงไหมค่ะถ้าจะสมัครเรียนที่นี้ในการเรียนจะมีค่าใช้จ่ายเท่าไร", 
                "เรียนโรงแรมต้องสำรองจ่ายประมาณเท่าไรก่อนอ่ะค่ะ", 
                "ติดต่อสมัครได้อย่างไรบ้างค่ะและสำรองการจองเป็นค่าเทอมได้เท่าไรบ้างค่ะ", 
                "ค่าสมัครต่องจ่ายเท่าไรหรือมัดจำไว้เท่่าไรก่อนค่ะและต้องจ่ายค่าเทอมเลยไหมคะ"
            ],
            "responses" : [ 
                "สามารถติดต่อทางวิทยาลัยได้เลยครับ", 
                "ขึ้นอยู๋กับสาขาวิชาครับ สามารถสอบถามวิทยาลัยได้่เลยครับ"
            ]
        }, 
        {
            "tag" : "computer_qurtion",
            "patterns" : [ 
                "สาขาคอมนี้เรียนยากไหมครับ", 
                "มีสาขาคอมเรียนยากไหมค่ะ", 
                "สายคอมพิวเตอร์เรียนยากไหมครับ", 
                "สาขาคอมเรียนยากป่าวครับ", 
                "สาขาคอมมีไรบ้าง", 
                "สาขาคอมแบ่งเป็นจำนวนเท่าไร", 
                "คอมเรียนยากไหม", 
                "สาขาคอมได้เรียนไรได้บ้าง", 
                "สาขาคอมเขียนโปรแกรมได้ไหม", 
                "สาขาคอมเรียนยากป่าวครับ", 
                "สาขาที่เรียนเกี่ยวกับคอมมันมีเท่าไรกี่สาขาหลอคะและมีสาขาอะไรบ้าง", 
                "สาขาคอมเรียนยากไหมคะและต้องเขียนโปรแกรมหรือเรียนอะไรมาก่อนไหมคะ", 
                "สาขาคอมที่เปิดสอนที่กี่สาขาหลอครับและประกอบด้วยอะไรบ้าง", 
                "สาขาคอมจำนวนีเท่าไรหลอครับที่ทางนนท์เปิดสอนครับ", 
                "สาขาคอมได้เรียนเกี่ยวกับอะไรบ้างและมีเปิดสอนสาขาไรบ้าง", 
                "สาขาคอมได้เรียนการเขียนโปรแกรมด้วยไหมครับและมันจะเรียนยากด้วยไหมครับ", 
                "สาขาคอมมีเท่าหมดกี่สาขาครับที่เปิดสอนและผมสามารถสมัครเรียนได้ในระดับชั้น ม3 ", 
                "สาขาที่เรียนเกี่ยวกับคอมมันจะเรียนยากไหมครับ", 
                "สาขาเที่ยวเกี่ยวกับคอมมีเท่าหมดกี่สามาขาหลอครับ", 
                "สาขาคอมแบ่งมาแล้วมีอะไรบ้างครับและมีจำนวนสาขาคอมเท่าไรหลอครับ"
            ],
            "responses" : [ 
                "สาขาคอมมีทั้งหมด 3 สาขา คือ คอมพิวเตอร์ธุรกิจ คอมพิวเตอร์กราฟิก เทคโนโลยีสานสนเทศ โดยแต่ละสาขาจะเรียนแตกต่างกันไป การเรียนจะเน้นไปทางเน้นการปฏิบัติจริง ครับ"
            ]
        }, 
        {
            "tag" : "Installment_payment",
            "patterns" : [ 
                "มีผ่อนชำระมั้ยครับ", 
                "สามารถผ่อนค่าเทอมได้ไหม", 
                "ผ่อนจ่ายค่าเทอมได้ไหม", 
                "ผ่อนค่าเทอมได้ไหมครับ", 
                "ผ่อนได่ไหม", 
                "ผ่อมได้ไหม", 
                "ผ่อนชำระได้ไหม", 
                "ผ่อนผันได้ไหม", 
                "ชำระแบบผ่อนได้ไหม", 
                "ชำละค่าเทอมแบบผ่อนได้ไหม", 
                "ผมสามารถทำเรื่องกาผ่อนชำระค่าเทอมได้ไหมครับ", 
                "หนูสามารถทำเรื่อนผ่อมค่าเทอมต้องทำยังไงบ้างหลอครับ", 
                "มีการผ่อนชำระค่าเทอมไหมครับและต้องทำยังไงบ้าง", 
                "ผ่อนชำระค่าเทอมแบบกำหนดได้ไหมครับว่าชำระทีละเท่าไร", 
                "ผมสามารถทำเรื่องการผ่อนผันการแบ่งชำระค่าเทอมได้ไหมครับ", 
                "ผ่อนชำระค่าเทอมขั้นต่ำต้องจ่ายเท่าไรหลอครับ", 
                "ทำเรื่องผ่อนผันค่าเทอมได้ที่ไหนบ้างค่ะและติดต่อได้ยังไงคะ", 
                "ชำระค่าเทอมแบบผ่อนผันได้สูงสุดกี่งวดหลอคะ", 
                "ค่าเทอมสามารถทำเรื่องผ่อนผัดชำระค่าเทอมได้ไหมคะ", 
                "มีระบบแบบผ่อนชำระค่าเทอมไหมคะ"
            ],
            "responses" : [ 
                "สามารถเข้ามาทำเรื่องผ่อนชำระเงินได้ที่วิทยาลัยได้เลยครับ", 
                "สามารถเข้ามาทำเรื่องได้ที่วิทยาลัยครับ"
            ]
        }, 
        {
            "tag" : "Sunday_Region",
            "patterns" : [ 
                "มีภาควันอาทิตย์มั้ยครับ", 
                "เรียนภาควันอาทิตย์มีไหม", 
                "เรียนวันอาทิตย์ได้ไหม", 
                "ภาควันอาทิตเปินสอนไหม", 
                "ภาควันอาทิตย์เปิดสอนแบบไหน", 
                "ภาควันอาทิตย์ต้องสมัครยังไง", 
                "ภาควันอาทิตย์รับสาขาไหนบอก", 
                "ภาควันอาทิตย์เรียนไปืทำงานไปได้ไหม", 
                "เรียนไปทำงานไปได้ไหม", 
                "เรียนด้วยทำงานไปด้วยได้ไหม", 
                "ผมสามารถทำเรียนไปทำงานไปได้ไหมครับ", 
                "ผมอยากเรียนไปแล้วทำงานไปด้วยต้องทำอย่างไร", 
                "ทางวิทยาลัยมีการเปิดสอนให้สามารถเรียนวันอาทิตย์และสามารถทำงานไปด้วยได้ไหมครับ", 
                "หนูอยากเรียนด้วยทำงานไปด้วยต้องเรียนวันไหนครับ", 
                "นนท์มีการเปิดภาพวันอาทิตย์ให้สมัครเรียนไหมครับ", 
                "ผมอยากได้ทำงานพร้อมกับเรียนไปด้วยผมควรทำอย่างไรครับ", 
                "ภาควันอาตย์มีสาขาไหนเปิดสอนบ้างครับ", 
                "สาขาที่มีภาควันอาทิตย์เปิดมีสาขาอะไรบ้างครับ", 
                "ผมจะสมัครภาควันอาทิตย์ต้องทำอย่างไรบ้าง", 
                "เรียนไปพร้อมทำงานจะมีสาขาไหนที่เปิดวันอาทิตย์บ้างคะ"
            ],
            "responses" : [ 
                "ทางวิทยาลัยมีเปิดภาควันอาทิตสามารถติดต่อสอบถามที่วิทยาลัยได้เลยครับ"
            ]
        }, 
        {
            "tag" : "enter",
            "patterns" : [ 
                "เข้ายากมั้ยครับ", 
                "ต้องสอบเข้ามั้ย", 
                "สอบเข้ายากไหม", 
                "คนรับเยอะไหม", 
                "ต้องสอบเข้าหรือเปล่า", 
                "ต้องสอบอย่างไร", 
                "สอบเข้าวิทยาลัยต้องรู้อะไนบ้าง", 
                "สอบเข้าอย่างไร", 
                "สอบเข้าทำไง", 
                "มีการสอบเข้าหรือเปล่า", 
                "การสอบมีการสอบเข้าอย่างไร", 
                "ทางวิทยาลัยมีการต้องทดสอบหรือสอบเข้าเรียนกับวิทยาลัยไหมครับ", 
                "หนูต้องสอบเข้าทาิยาลัยได้อย่างไรบ้าง", 
                "ทางวิทยาลัยมีการสอบเข้าด้วยไหมครับ", 
                "จะรับคนการเข้าเรียนเยอะไหมครับในการสมัครแต่ละครั้ง", 
                "ผมจะสอบเข้ากับทางวิทยาลัยแล้วต้องรู้เรื่องอะไรบ้างครับ", 
                "หนูจะสอบเข้ากับทางวิทยาลัยยากไหมค่ะ", 
                "ผมต้องเตรียมตัวาอบเข้าต้องทำอย่างไรบ้างหลอครับ", 
                "คนสมัครกับอัตราการรับอยู่ที่จำนวนคนเข้าสมัครในการสอบเยอะไหมครับ", 
                "ผมสอบถามหน่อย่าทางวิทยาลัยมีการสอบเข้าวิทยาลัยหรือเปล่า", 
                "ผมต้องทำเรื่องสมัครสอบได้อย่างไรบ้างครับ", 
                "หนูต้องเตรียมความรู้ในเรื่องอะไรบ้างหลอค่ะในการสอบอ่ะคะ"
            ],
            "responses" : [ 
                "ทางวิทยาลัยไม่มีนโยบายในการสอบเข้าสถานศึกษา นักเรียนสมารถมาสมัครได้เลยครับ"
            ]
        }, 
        {
            "tag" : "enter_de",
            "patterns" : [ 
                "รับสาขาอะไรบ้างครับ", 
                "เรียนคอมมาสมัครได้ไหมครับ", 
                "จบสามัญมาสมัครได้ไหมครับ", 
                "จบการฟิกสมัครได้ไหม", 
                "จบตลาดที่อื่นมาสมัครเรียนต่อที่นี้ได้ไหม", 
                "จบกราฟิกมาสมัครได้หรือเปล่า", 
                "ใช้วุฒิ ม.3 มาสมัครได้ไหม", 
                "วุฒิ ม.3 มาสมัครคอมธุรกิจ", 
                "วุฒิต้องใช้ตัวจริงสมัครเลยหรือเปล่า", 
                "วุฒิ ม 3 ต้อง ใช้ตัวจริงไหมครับ", 
                "จบสายอาชีพ วุฒิ ปวช 3 มาสมัครเรียนสาขา it ปวส ได้ไหมครับ", 
                "จบการตลาดแล้วมาต่อ ระดับชั้น ปวส. ที่วิทยาลัยนี้ได้ไหม", 
                "จบจากวิทยาลัยสะพานใหม่แล้วมาสมัครต่อที่นนท์ได้ไหม", 
                "ใช้วุฑิตัวจริงไหมครับ ในการยื่นให้สมัครเรียน", 
                "ยื่นด้วยวุฒิตัวจริงไหมครับหรือแค่สำเนาวุฒิมาสมัครเรียนก่อนได้ครับ", 
                "วุฒิใช้งานของ ม ปลาย มาสมัครเรียน คอมธุรกิจที่นี้ได้ไหมครับ", 
                "จบกราฟิกระดับชั้นปวช. จากวิทยาลัยอื่นต้องเตรียมเอกสารไรบ้างที่จะมาสมัครในระดับ ปวส อ่ะครับ", 
                "เรียนสามัญ มัธยมมากำลังจะจบต้องรอวุฒิก่อนไหมถึงจะสมัครได้", 
                "จบสายอาชีพ ปวช มาผมสามารถมาเรียนต่อในดับ ปวส สาขาที่ไม่ตรงกับวุฒิได้ไหม", 
                "วุฒิของคอมพิวเตอร์กราฟิกเียนต่อที่นี้ได้ไหม"
            ],
            "responses" : [ 
                "สามารถมาสอบถามที่วิทยาลัยได้เลยครับในการสมัครเรียน"
            ]
        }, 
        {
            "tag" : "where_univer",
            "patterns" : [ 
                "มีวิทยาเขตไหมครับ", 
                "เรียนวิทยาเขตสะพานใหม่ได้ไหม", 
                "มีกี่วิทยาเขต", 
                "มีวิทยาเขตไหนบ้าง", 
                "เรียนวิทยาเขตสะพานใหม่ได้ไหม", 
                "วิทยาเขตมีสาขาเหมือนกันไหม", 
                "วิทยาเขตเรียนเหมือนกันไหม", 
                "แต่ละวิทยาเขตโรงอาหารเหมือนกันไหม", 
                "วิทยาเขตสะพานใหม่มีคอมธุรกิจไหม", 
                "วิทยาเขตสะพานใหม่มี เทคโนโลยีสารสนเทศไหม", 
                "วิทยาลัยนี้มันเปิดการเรียนการสอนกี่วิทยาเขตหลอครับ", 
                "วิทยาลัยนนี้การเรียนการสอนให้มาตรฐานหลักสูตรที่เหมือนกันไหมครับ", 
                "ทางวิทยาลัยสะพาณใหม่เปิดเรียนเปิดสอนเหมือยกัยวิทยาเขตกับนนท์ไหมครับ", 
                "วิทยาลัยเขตสะพาณใหม่เปิดเรียนสอน it เหมือน นนทบุรีไหมครับ", 
                "วิทยาลัยวิทยาเขตมีจำนวนเท่าไรหลอครับที่ผมสามารถเดินทางได้สะดวกอ่ะครับ", 
                "เรียนสาขาทคโนโลยีสารสนเทศของนนทบุรี เหมือนวิทยาเขตสะพาณใหม่หรือเปล่าครับ", 
                "วิทบาเขตนนท์เปิดการเรียนการสอนเหมือนทางวิทยาเขตสะพานใหม่หรือเปล่าครับ", 
                "ทางวิทยาเขตนนทบุรีมีคอมธุรกิจเหมือนสะพาณใหม่หรือเปล่า", 
                "วิทยาเขตนนทบุรีเรียนเหมือนสะพาฯใหม่มั่ย", 
                "วิทยาเขตนนท์มีโรงอาหารเหมือนสะพาณใหม่ที่เปิดตัวโรงอาหารใหม่ไหมครับ"
            ],
            "responses" : [ 
                "วิทยาเขตสะพานใหม่หรือนนทบุรีมีการเรียนการสอนอยู่ในมาตารฐานเดียวกันทำให้สามารถเลือกเรียนได้ต่างที่สะดวกเลยครับ"
            ]
        }, 
        {
            "tag" : "techno",
            "patterns" : [ 
                "เทคโยโลยีมีความสำคัญในยุกปัจจุบันมากน้อยแค่ไหน", 
                "เทคโนโลยีมีความสำคัญในอนคตรหรือเปล่า", 
                "เทคโนโลยีเข้ามาช่วยในชีวิตประจำวันได้อย่างไร", 
                "เทคโนโลยีทำอะไรได้บ้าง", 
                "เทคโนโลยีจะมีทำเยอะไหม", 
                "เทคโนโลยีจะเข้ามาเปลียนชีวิตได้อย่างไร", 
                "อนาคตเทคโนโลยีจะมีงานจะเยอะไหม", 
                "เทคโนโลยีในโรงพยาบาล", 
                "เทคโนโลยีในการขับรถยนต์จะเป็นเช่นไร", 
                "เทคโนโลยีต่างประเทศเป็นอย่าไร", 
                "ผมอยากเรียนว่าเทคโนโลยีทุกววันนี้มีผมอย่างไรในการใช้ร่วมชีวิตกับเทคโนโลยีหลอครับ", 
                "ผมอยากเรียนว่าในอนาคตจะเป็นอย่างไรว่าเทคโนโลยีจะเป็นอย่างไรบ้างหลอครับ", 
                "หนูอยากเรียนว่าการนำเทคโนโลยีเข้ามาช่วยในโรงพยาบาลกับการขับรถยนต์ไร้คนขับมันจะอัตรายไหมคะ", 
                "อนาคตจะเป็นอย่างไรบ้างครับกับการเปลียนแปลงของเทคโนโลยี", 
                "การเข้ามาของเทคโนโลยีผมอยากรู้ว่าอนาคตเราจะเปลียนการใช้ชีวิตไปเป็นอย่างไรบ้างครับ", 
                "ความสำคัญของเทคโนโลยีในยุคปัจจุบันกับยุคนี้มันจะเปลียนไปจากเดิมไหมครับ", 
                "งานที่จะช่วยในการพัฒนามีการพัฒนางานที่เยอะไหมครับกับชีวิตประจำวันของเรา", 
                "โรงพยาบาลจะสามารถนำเทคโนเทลยีมาใช้ได้ไหมคะ", 
                "อนาคตต่างประเทศจะเปลียนการนำเทคโนโลยีมาใช้เยอะไหมครับ", 
                "เทคโนโลยีมันคืออะไรและพัฒนาต่อยอดได้อย่างไรครับ"
            ],
            "responses" : [ 
                "เทคโนโลยีมีการต่อยอดและพัฒนาตัวเองได้ตลอดเวลาอยู่แล้วครับ"
            ]
        }, 
        {
            "tag" : "teacher",
            "patterns" : [ 
                "เรียนสายอาชีพสามารถเรียนต่อเป็นครูได้ไหมคะ", 
                "อยากเป็นครูต่อเรียนสายอาชีพได้ไหม", 
                "สายอาชีพเป็นครูได้เปล่า", 
                "สายอาชีพครูมีเยอะไหม", 
                "สายอาชีพมีการเป็นครูได้หรือเปล่า", 
                "สายอาชีพเป็นครูต้องทำอย่างไร", 
                "สายอาชีพครูต้องเตรียมตัวอะไรบ้าง", 
                "สายอาชีพครูต้องเรียนยังไง", 
                "สายอาชีพเป็นครูต้องเรียนอะไรต่อ", 
                "สายอาชีพครูเป็นความต้องการหรือเปล่า", 
                "ผมอยากเป็นครูแต่เรียน it ผมจบสามารถไปเป็นครูได้ไหมครัย", 
                "อยากจะสอบผมครูต้องเตรียทตัวอะไรบ้างครับเวลาจะไปสอบอ่ะครับ", 
                "ผมจะสอบบรรจุเป็นครูผมต้องเตรียมตัวยังไงก่อนหลอครับ", 
                "อาชีพครูต้องไปเรียนต่อศึกษาทีไหนต่อหลอครับ", 
                "หนูอยากรู้ว่าสายครูยังเป็นความต้องการอยู่หรือเปล่าครับ", 
                "สายอาชีพครูต้องเตรียมตัวอย่างไรบ้างหลอค่ะก่อนจะไปเป็นคุณครูสอนได้อ่ะค่ะ", 
                "เรียนครูจะสามารถประกอาชีพครูได้อย่างไรบ้างครับ", 
                "หนูต้องการเรียนสายอาชีพครูค่ะแต่หนูไม่รู้ว่าจะเรียนต่ออย่างไร", 
                "ครูต้องมีการเรียนอาชีพอะไรมาก่อนหลอครับ", 
                "สายอาชีพครูต้องจบระดับชั้นการศึกษาอะไรมาก่อนและต้องเรียนจบไหมครับ"
            ],
            "responses" : [ 
                "หลักจากจบ การศึกษาระดับชั้น ป ตรี สามารถสมัครเรียน ป.บัณฑิต และต่อยอดเป็นครูได้ครับ "
            ]
        }, 
        {
            "tag" : "IT",
            "patterns" : [ 
                "ถ้าผมอยากเขียนโค้ดเก่งๆสามารถเรียนสาขาitได้ไหมครับ ", 
                "ไอทีสอนเขียนเว็บมั้ยครับ", 
                "ถ้าผมอยากเป็นโปรแกรมเมอร์เรียนสาขา it ได้ไหมครับ", 
                "การเรียนสาขาเทคโนโลยีสารสนเทศเรียนเกี่ยวกับอะไรบ้างครับ จบแล้วสามารถเป็น โปรแกรมเมอร์ได้หรือป่าว", 
                "แล้วสาขาเทคโนโลยีสารสนเทศได้เขียนโปรแกรมไหมครับ", 
                "ไอทีสอนอะไรบ้าง", 
                "ถ้าผมอยากเป็นทำงานสายเน็ตเวิรณ์ต้องทำไง", 
                "อยากเรียนสายที่เกียวกับเขียนหรือพัฒนาเว็บต้องเรียนอะไร", 
                "ไอทีงานด้าน AI มีเยอะไหม", 
                "อยากเรียน AI ต้องทำอย่างไร", 
                "จะเรียนสาขา it ต้องเขียนโค้ดเก่งไหมถึงจะเรียนสาขานี้ได้ครับ", 
                "หนูเรียนสาขาเทคโนโลยีสารสนเทศจะได้เรียนเกี่ยวกับอะไรบ้างและได้เขียนโปรแกรมไหมค่ะ", 
                "สาขาไอทีจะได้เรียนเกียวกับอะไรบ้างหลอ่ะและได้เป็นโปรแกรมเมอร์ไหมคะ", 
                "ถ้าอยากทำเรื่องของ AI สาขา it มีการสอนให้ไหมคครับ", 
                "ถ้าผมอยากเรียนเกี่ยวกับการเขียนโปรแกรมและเน็ตเวิรณ์จะมีการสอนให้ผมไหมครับในสาขา it อ่ะครับ", 
                "สาขา IT ผมจะได้เรียนเรื่องของ AI และมีการสอนเขียนเว็บไหมครับ", 
                "การเรียนสาขาเทคโนโลยีสารสนเทศ มีการสอนแบบไหนบ้างครับ", 
                "สาขา it จะได้เรียน AI เยอะไหมครับและเรียนเกี่ยวกับอะไรบ้าง", 
                "ผมสามารถเรียนเทคโนโลยีสารสนเทศและสามารถไปเป็นโปรแกรมเมอร์ตามบริษัทต่างๆ ได้ไหม", 
                "การเรียนเน็ตเวิรณ์สาขา it จะได้เรียนเรื่องเกี่ยวกับอะไรบ้างหลอครับ"
            ],
            "responses" : [ 
                " การเรียน IT เรียนทั้งการเขียนโปรแกรม เครือข่าย และ การเรียนทุกอย่างที่เกี่ยวกับคอม หรือสามารถไปต่อยอดความรู้ไปในด้านต่าง ๆ ได้ครับ"
            ]
        }, 
        {
            "tag" : "soider",
            "patterns" : [ 
                "เรียนอาชีวะสามารถผ่อนผันการเกณฑ์ทหารได้ไหมครับ", 
                "สามารถทำเรื่องผ่อนผันการเกณฑ์ทหารได้ไหม", 
                "สามารถเลื่อนการเกณฑ์ทหารได้ไหม", 
                "ไม่เคยทำเรื่องผ่อนผันการเกณฑ์ทหารสามารถมาทำที่นี้ได้ไหม", 
                "ผ่อนผันการเกณฑ์ทหารได้สูงสุดกี่ปี", 
                "ผ่อนผันการเกณฑ์ทหารต้องเตรียมเอกสารไรบ้าง", 
                "ผ่อนผันการเกณฑ์ทหารต่อเนื่องได้เท่าไร", 
                "มีการทำเรื่องผ่อนผันการเกณฑ์ทหารให้ไหม", 
                "ผ่อนผันการเกณฑ์ทหารเตรียมเอกสารไรได้บ้าง", 
                "ผ่อนผันการเกณฑ์ทหารมีอายุกี่ปี", 
                "ผมปีหน้าต้องไปเกณฑ์ทหารแต่ผมยังอยากเรียนก่อนผมต้องไปทำเรื่องที่ไหนและเตรียมเอกสารไรบ้างหลอครับ", 
                "ผมผ่อนการเกนทหารไปแล้วหนึ่งปีแล้วครับ มันสามรถผ่อนผันการเกณฑ์ทหารได้สูงสุดเท่าไรครับ", 
                "ผมไม่เคยทำเรื่องการผ่อนผันการเกณฑ์ทหารแล้วต้องทำอย่างไรครับ", 
                "ผมต้องการผ่อนผันเกณฑ์ทหารได้เช่นไรหลอครับและติดต่ออย่างไร", 
                "เอกสารผ่อนผันการเกณฑ์ทหารหายต้องทำอย่างไรบ้างครับ", 
                "เอกสารผ่อนผันการเกณฑ์ทหารมีอะไรบ้างครับ", 
                "เลื่อนการเกณฑ์ทหารผมต้องติดต่อกับแผนกไหนแล้วครับหรือฝ่ายไหนอ่ะครับ", 
                "การผ่อนผันการเกณฑ์ทหารต่อเนื่องได้สูงสุดมากสุดเท่าไรหลอครับ", 
                "เกณฑ์ทหารปีหน้าแล้วผมต้องทำอย่างไรหลอครับ", 
                "ผมสามรถมาทำเรื่องการผ่อนผันการเกณฑ์ทหารได้ที่นี้เลยไหมครับ"
            ],
            "responses" : [ 
                "นักเรียนชาย สามารถทำเรื่อง ผ่อนผันการเกนทหารได้โดยสามารถติดต่อได้ที่ ฝ่ายพัฒนาผู้เรียน ได้เลยครับ "
            ]
        }, 
        {
            "tag" : "langue_program",
            "patterns" : [ 
                "สาขาITมีภาษาที่ต้องใช้หลักๆกี่ภาษา", 
                "it ต้องเรียนกี่ภาษา", 
                "สาขาเทคโนโลยีสารสนเทศ it ภาษาหลักคืออะไร", 
                "it นิยมใช้ภาษาอะไร", 
                "สาขา it ภาษายอดนิยมคือ", 
                "สาขา it ได้เรียนไรบ้าง", 
                "สาขา it ภาษายากไหม", 
                "สาขา it เรียน ภาษาได้อะไรบ้าง", 
                "สาขา it สาขา นี้เขียนโปรแกรมเกียวกับอะไร", 
                "ภาษาที่เรียนในสาขา it ต้องเตรียมตัวเรียนกับภาษาอะไรบ้าง", 
                "จะได้เรียนการเขียนโปรแกรมภาษาอะไรบ้างหลอครับ", 
                "โปรแกรมภาษาที่ทางวิทยาลัยได้นมาสอนกับพวกนักเรียนมีอะไรบ้างครับ", 
                "ภาษาในสาขา it มีหลายภาษาไหมครับที่จะได้เรียน", 
                "ภาษาที่ได้เรียนเกี่ยวกับการทำเว็บไซค์มีสอนไหมครับ", 
                "ภาษาในการเขียนเว็บไซค์ประกอบด้วยภาษาอะไรบ้าง", 
                "ภาษาได้ที่รับการนิยมตอนนี้จะมีสอนในสาขาเทคโนโลยีสารสนเทศบ้างไหมครับ", 
                "แผนก it สอนภาษาอะไรให้กับนักเรียนอะไรเป็นหลัก", 
                "ผมจะได้เรียนเกี่ยวกับภาษาที่ it เขียนมีอะไรบ้าง", 
                "ภาษาในการเขียนโปรแกรมมันมีเยอะมากไหมครับ", 
                "ผมจะได้เรียนการเขียนโปรแกรมหลายภาษาในสาขาเทคโนโลยีสารสนเทศเยอะจริงกับทางเพจบอกไหมครับ"
            ],
            "responses" : [ 
                "นักเรียนจะได้เรียนหลากหลายภาษา แต่จะมีการเรียนการสอนเบื้องต้นในทุกภาษา เช่น c , c++ , c# , vb , SQL , HTMl เป็นต้น"
            ]
        }, 
        {
            "tag" : "comgrafphic_lear",
            "patterns" : [ 
                "ถ้าต้องการเรียนเกี่ยวกับการตัดต่อ ควรเลือกเรียนสาขาอะไร", 
                "การตัดต่อเลือกสาขาอะไร", 
                "การตัดต่อคลิบเรียนสาขาอะไร", 
                "การตัดต่อวีดีโอเลือกสาขาอะไร", 
                "การตัดต้อขั้นสูงควรเรียนสาขาอะไร", 
                "การตัดต่อบุคคลต้องเรียนสาขาอะไร", 
                "การตัดต่อโฆษนาเลือกเรียนอะไร", 
                "การตัดต่อสื่อสิ่งพิมควรเลือกสาขาอะไร", 
                "การตัดต่อเรียนนานไหม", 
                "การตัดต่อเรียนได้อย่างไร", 
                "ผมสนใจเรื่องของการตัดต่อวีดีโอผมควรเลือกกาพิจรณาในสาขาอะไรดีครับ", 
                "การตัดต่อสื่อให้ออกมาดีผมไม่รู้ว่าจะเลือกสาขาอะไรดีอ่ะครับ", 
                "การตัดต่องานใน photoshop ผมจะเรียนการใช้เครื่องมือได้ในสาขาอะไรหลอครับ", 
                "กราฟิกจะได้เรียนการใช้เครื่องมือการตัดด่อด้วยไหมครับ", 
                "ผมอยากรู็ว่าการตัดต่อคลิบมันต้องใช้เครื่องมืออะไรหลอครับ", 
                "ผมใช้ macbook ตัดต่อคลิบจะดีไหมครับ", 
                "วีดีโอต้องตัดต่อยังไงหลอค่ะให้คนดูแล้วมีความหน้าสนใจมากขึ้น", 
                "การเรียนการสอนในการตัดต่อวีดีโอมันนานไหมครับในการเรียน", 
                "การเขียนโฆษาต้องอาศัยการตัดต่อยังไงให้มีความหน้าใจ", 
                "สื่อสิงพิมพ์ออกแบบและตัดต่อยังไงดีครับว่าให้มีความหน้าในใจ", 
                "ขั้นสูงของการทำสื่อสิ่งพิมพ์ผมจะได้เรียนในสาขาคอมพิวเตอร์กราฟิกไหมครับ", 
                "การเลือกงานกราฟิกแบบการตัดต่อผมเลือกสาขาการออกแบบและตัดต่อยังไงดีค่ะ"
            ],
            "responses" : [ 
                "นักเรียนที่สนใจด้านการตัดต่อสามารถเลือกเรียนสาขาคอมพิวเตอร์กราฟิกจะมีการสอนเรื่องตัดต่อด้วยครับ "
            ]
        }, 
        {
            "tag" : "goof_learn",
            "patterns" : [ 
                "บอกข้อดีของการเรียนสายอาชีพหน่อยได้มั้ยครับ", 
                "จบอาชีพดีกว่าสายตรงยังไง?", 
                "จบสายอาชีพกับสายตรงต่างกันยังไง", 
                "จบอาชีพกับสายตรงหางานง่ายกว่ากัน", 
                "จบสายอาชีพมีอะไรดี", 
                "สายอาชีพมีอะไร ดีกว่าสายตรง", 
                "อาชีพกับสายตรงต่างกันอย่างไร ", 
                "อาชีพข้อเสียมีอะไรบ้าง", 
                "อาชีงานรองรับเยอะไหม", 
                "สายอาชีพรองรับเยอะไหม", 
                "ผมอยากรู้ว่าสายอาชีพมันมีข้อดีกว่าเรียนสาย มปลายอย่างไรหลอครับ", 
                "ผมอยากรู้ว่าอาชีพมีขอดีอย่างไรหลอครับว่าจะสามารถให้ผมเรียนสายอาชีพนี้ได้", 
                "สายอาชีพมีข้อดีอะไรบ้างหลอครับ", 
                "ผมอยากรู่ว่าสายอาชีพมีข้อจำกัดอะไรบ้างไหมครับกับอนาคต", 
                "สายอาชีพมีข้อเสียหรือเปล่าครับและข้อเสียมีอะไรร้ายแรงไหม", 
                "สายอาชีพแตกต่างกับสายตรงได้อย่างไรบ้างครับ", 
                "สายอาชีพจะหางานมันง่ายไหมครับถ้าผมจบสายอาชีพ", 
                "การเรียนสายอาชีพมันจะหางานยากไหมครับ", 
                "ถ้าเรียนสายตรงจะหางานยากกว่าหรือง่ายกว่าสายอาชีพไหมครับ", 
                "ข้อดีเยอะไหมครับของการเรียนต่อสายอาชีพ"
            ],
            "responses" : [ 
                " สายอาชีพ ดูรายละเอียดเพิ่มได้ https://th.jobsdb.com/th-th/articles/%E0%B8%AA%E0%B8%B2%E0%B8%A2%E0%B8%AD%E0%B8%B2%E0%B8%8A%E0%B8%B5%E0%B8%9E%E0%B8%AA%E0%B8%B9%E0%B9%88%E0%B8%84%E0%B8%A7%E0%B8%B2%E0%B8%A1%E0%B8%AA%E0%B8%B3%E0%B9%80%E0%B8%A3%E0%B9%87%E0%B8%88/"
            ]
        }, 
        {
            "tag" : "market",
            "patterns" : [ 
                "สายไหนได้รับความนิยมจากตลาดแรงงานมากกว่ากันครับ", 
                "ตลาดแรงงานกับสายตรงสายไหนมีความต้องการมากว่ากัน", 
                "ตลาดแรงงานกับสายตรงต่างกันมากไหม", 
                "ตลาดแรงงานกับสายตรงอันไหนต้องการของตลาดมาก", 
                "ตลาดแรงงานกับสายตรงต้องการตลาดมากกว่ากัน", 
                "ตลาดแรงงานกับสายตรงอันไหนหางานง่ายกว่ากัน", 
                "ตลาดแรงงานกับสายตรงอันไหนมีคนทำน้อยกว่ากัน", 
                "ตลาดแรงงานกับสายตรงต้องการของตลาดใช่ไหม", 
                "ตลาดแรงงานกับสายตรงใหญ่ไหม", 
                "ตลาดแรงงานกับสายตรงต้องการเยอะไหม", 
                "ถ้าผมจบไปแล้วมันจะมีการแข่งขันในการหางานทำบ้างไหมครับ", 
                "จะจบปีหน้าแล้วจะมีตลาดแรงงานที่ต้องการคนเยอะบ้างไหมครับ", 
                "งานในตลาดแรงงานมีเปิดต้องการงานเยอะบ้างไหม", 
                "การจะได้งานในตลาดแรงงานผมต้องเตรียมตัวได้อย่างไรบ้าง", 
                "การที่ผมยังเป็นคนที่ว่างงานในเรียนจบในตลาดแรงงานต้องการคนแบบไหนบ้างที่จะให้ได้งาน", 
                "การหางานในตลาดแรงงงานมีการแย้งกันเยอะไหม", 
                "การหางานในช่วงปัจุบันจะมีปัญหาในการหางานในตลาดแรงงานเยอะไหมครับ", 
                "องศ์กรต่างมีต้องการแรงงานเยอะขนาดไหนที่มากพอต่อตลาดแรงงาน", 
                "ตลาดแรงงานกับสายอาชีพมีความต้องการมากน้อยแค่ไหนหลอครับ", 
                "การทำงานตลาดแรงงานเยอะมากแค่ไหนบ้างหลอครับที่จะมีโอกาศที่จะได้งานทำอ่ะครับ"
            ],
            "responses" : [ 
                "ตลาดแรงงานกับสายอาชีพเป็นความต้องการสูงในการนำบุคคลไปทำงานต่าง ๆ องค์กรต่าง ๆ ที่แตกต่างกันไปขึ้นอยู๋กับสาขาวิชาที่จบมาครับ ควรพัฒนาตัวเองอยู่ตลอดเวลาเพื่อให้เป็นความต้องการของตลาดแรงงาน"
            ]
        }, 
        {
            "tag" : "dif_com",
            "patterns" : [ 
                "คอมธุรกิจกับไอทีต่างกันยังไงครับ", 
                "คอมพิวเตอร์ธุรกิจกับเทคโนโลยีสารสนเทศต่างกันอย่างไร", 
                "BC กับ IT ต่างกันอย่างไร", 
                "ไอที กับ คอมธุรกิจต่างกันอย่างไร", 
                "คอมธุรกิจ เรียนต่างกับ it ยังไง", 
                "คอมธุรกิจ ต่างกันอย่างไรบ้างกับเทคโนโลยีสารสนเทศ", 
                "it กับ bc ต่างกันแบบไหนบ้าง", 
                "คอมธุรกิจกับเทคโนโลยีสารสนเทศการเรียนต่างกันไหม", 
                "it กับ bc หางานต่างกันไหม", 
                "การสอนของสาขาเทคโนโลยีสารสนเทศ กับ คอมพิวเตอร์ธุรกิจจะมีการเรียนการสอนที่แต่ตามกันอย่างไรบ้าง", 
                "การต่างของสาขาคอมมีอะไรบ้างหลอครับระหว่างคอมธุรกิจกับไอที", 
                "เรียนไอทีเราจะย้ายไปคอมธุรกิจมันแแตกต่างกันยังไงบ้างครับ", 
                "เรียนสาขา it แตกต่างกันมากไหมกับ คอมพิวเตอร์ธูรกิจอ่ะครับในการเรียน", 
                "การเล่าเรียนสาขานี้มีการทำงานหรอเรียนบ้างยังไงครับ", 
                "ระหว่างการเรียนสองสาขา it กับ bc แตกต่างกันมากไหม", 
                "สาขาพี่น้องนี้มีการเรียนที่ยังไงระหว่าง it กับ bc", 
                "วิชาในสาขา คอมธุรกิจ กับ ไอทีแตกต่างกันมากไหม", 
                "เรีบยต่างกันมากไหมระหว่าง itกับ bc", 
                "คอมธุรกิจยากกว่าit จริงไหม"
            ],
            "responses" : [ 
                "ต่างกันที่รายวิชาการเรียนการสอนและการแบ่งสายงานทำด้วยครับสามารถ อ่านเพิ่มเติมได้ที่เว็บวิทยาลัยได้เลยครับ"
            ]
        }, 
        {
            "tag" : "comsci",
            "patterns" : [ 
                "ถ้าสมมุติอยากเรียนวิศวะคอมเรียนคอมธุรกิจก่อนได้มั้ย", 
                "ถ้าสมมุติอยากเรียนวิทคอมเรียนไอทีก่อนได้มั้ย", 
                "ถ้าจะเรียนวิศวะซอฟต์แวร์ควรเรียนต่อสายไหน", 
                "ถ้าจะเรียนวิศวะซอฟต์แวร์ควรเรียนต่อสายไหนครับ", 
                "จะเรียนสายวิทยาการคอมพิวเตอร์สามารถเรียนคอมพิวเตอร์ธุรกิจก่อนได้ไหม", 
                "วิศวะคอมเรียนเกี่ยวกับอะไรบ่างครับ", 
                "ถ้าจะเรียนต่อวิศวะ", 
                "ถ้าเราเรียนคอมธุรกิจในระดับ ปวช.แล้วจะย้ายไปเรียนวิศวคอมในระดับมหาลัยได้ไหม", 
                "วิศวคอมพิวเตอร์เรียนอะไรบ้างครับ", 
                "การเรียนวิศวคอมพิวเตอร์ยากไหมครับ?", 
                "ถ้าผมจบที่คอมธุรกิจไปต่อวิศวะคอมไดไหมผมควรเรียนต่อสายไหน", 
                "ถ้าหลานผมจะไปเรียนวิศวะก่อนผมต้องเตรียมตัวให้หลานยังไงหลอครับ", 
                "วิศวะต้องเรียนรู้เรื่องใดบ้างก่อนที่จะไปสอบเข้าครับ", 
                "การได้เรียนวิศวะควรเรียนสายมปลาย หรือสายอาชีพมากกกว่ากะน", 
                "หนูอยากเป็นวิศวะคอมหนูเรียนไอทีได้ไหมและสามารถไปต่อได้หรือเปล่า", 
                "การที่จะไปเตรียมตัวการเรียนวิศวะต้องเตรียมตัวได้อย่างไรบ้าง", 
                "ปวช.สายไอทีไปต่อวิศวะได้ยังไงบ้างครับ", 
                "วิศวะแบ่งการเรียนได้ไหมควรไปต่อเพื่อจะเรียนสาขานี้ยังไง", 
                "การเขียนโปรแกรมในสาขาวิศวะเนี่ยต้องเรียนด้านไหนบ้างและเรียนสายไหนมาก่อน", 
                "ทำยังไงได้บ้างที่จะให้ได้เข้าไปเรียนสายวิศวะ", 
                "การต่อสายวิศะควยพิจารณาในการต่อสายวิชาเรียนสาขาไหนหลอครับ", 
                "วิศวะคอมต้องเรียนสายไหนยังไงบ้าง"
            ],
            "responses" : [ 
                "ปกติแล้วการเลือกเรียนต่อสายวิศวะคอมหรือวิทยาการคอมนั้น จะเน้นไปทางสายวิทย์-คณิตมากกว่าครับ ดังนั้นจึงควรเรียนทางสายมอปลายมากกว่าครับ"
            ]
        }, 
        {
            "tag" : "government",
            "patterns" : [ 
                "เรียนสายคอมเป็นข้าราชการได้มั้ย", 
                "เรียนการตลาดเป็นราชการได้ไหม", 
                "เรียนคอมธุรกิจเป็นราชการได้หรือเปล่า", 
                "เรียนโรงแรมเป็นราชการได้มั้ย", 
                "เรียน it เป็นราชการ ได้ไหมครับ", 
                "ราชการรับสายอาชีพไหมครับ", 
                "ราชการรับอาชีวะไหม", 
                "การเป็นราชการต้องเรียนสามัญมาใช่ไหม", 
                "การเป็นราชการต้องเรียนกกฎมหายอย่างเดียวหรือเปล่า", 
                "เป็นราชการต้องสายตรงอย่างเดียวหรือเปล่า", 
                "ถ้าผมจะไปสอบเข้าราชการผมสามารถเรียนสายอาชีพได้ไหม", 
                "ถ้าหนูจบไปต่อราชการมันจะสอบได้ไหม", 
                "ถ้าหนูจบสาขาการโรงแรมจะสามารถไปสอบราชการได้ไหม", 
                "ถ้าเรียนไม่ตรงสายกับราชการโดยตรงสามารถไปสอบได้ไหม", 
                "ถ้าหลานจะไปสอบราชการควรพิจรณาในการไปสอบได้อย่างไรบ้าง", 
                "เป็นราชกาสามารถเรียนสายอาชีพไปสอบได้ไหม", 
                "ผมสอบราชการทหาร ตำรวจได้ไหมถ้าผมจะเรียนสายอาชีพไปสอบ", 
                "ราชการเขารับสายอาชีพบ้างไหมครับ", 
                "ราชการเปิดให้สายอาชีพไปสอบได้ไหม", 
                "การสอบของสายอาชีพทำได้อย่างไรบ้างครับในการสอบราชการ"
            ],
            "responses" : [ 
                "อาชีพสามารถเป็น ข้าราชการได้ทุกสาขาวิชาขึ้นอยู่ว่าข้าราชการจะเปิดรับสาขาไหนบ้าง"
            ]
        }, 
        {
            "tag" : "bc",
            "patterns" : [ 
                "คอมพิวเตอร์ธุรกิจสอนหลักสูตรอะไรบ้าง", 
                "คอมพิวเตอร์ธุรกิจเน้นการเรียนเรื่องอะไรบ้าง", 
                "เรียนสายคอมพิวเตอร์ธุรกิจสามารถต่อสายไหนได้บ้าง", 
                "คอมธุรกิจเป็นผู็บริหารได้ไหม", 
                "คอมธุรกิจทำบัญชีได้ไหม", 
                "เรียนคอมธุรกิจตรวจสอบบัญชีไดได้ไหม", 
                "คอมธุรกิจเน้นอะไรเป็นพิเศษ", 
                "คอมธุรกิจโดยรวมเรียนเรื่องอะไร", 
                "คอมธุรกิจได้ใช้คอมไหม", 
                "คอมธุรกิจได้งานเยอะไหม", 
                "ผมอยากเรียนเรื่องบริหารสามารถเรียนคอมธุรกิจได้ไหม", 
                "คอมพิวเตอร์ธุรกิจได้เรียนอะไรบ้างหลอคะ", 
                "bc เน้นการเรียนไปด้านไหนหลอครับ", 
                "ถ้าเรียนสาขา bcโดยรวม bc เขาาอนเรื่องอะไรบ้างหลอครับ", 
                "การเรียนคอมพิวเตอร์ธุรกิจอาจรย์สอนการนำเทคโนโลยีมาใช้อย่างไรบ้าง", 
                "ผมเรียนสาขา bc ไปเป็นผู้บริหารได้ไหม", 
                "ถ้าเรียนสาขาคอมธูรกิจจะได้เรียนเกี่ยวกับคอมเยอะไหม", 
                "เรียนสาขาคอมธุรกิจะเป็นการเรียนรู้การบริหารหลือเปล่า", 
                "สาขา bc จะได้เรียนการทำัญชีด้วยไหมครับ", 
                "คอมธุรกิจเน้นบัญชีไปด้วยไหมครับ"
            ],
            "responses" : [ 
                "การเรียนคอมธุรกิจจะได้เรียนรู้การบริหารองค์กรณ์และการนำเทคโนโลยีเข้ามาช่วยในธุรกิจด้วยครับ"
            ]
        }
